ultramango/radare2-extras/stm8/stm8_optable.c
/** File based on naken_asm
 *
 *  naken_asm assembler.
 *  Author: Michael Kohn
 *   Email: mike@mikekohn.net
 *     Web: http://www.mikekohn.net/
 * License: GPLv3
 *
 * Copyright 2010-2017 by Michael Kohn
 *
 * Modified to work as a radare2 plugin
 *
 */

#include "stm8_optable.h"

const struct _table_stm8 table_stm8[] = {
  { "adc", STM8_ADC },
  { "add", STM8_ADD },
  { "addw", STM8_ADDW },
  { "and", STM8_AND },
  { "bccm", STM8_BCCM },
  { "bcp", STM8_BCP },
  { "bcpl", STM8_BCPL },
  { "break", STM8_BREAK },
  { "bres", STM8_BRES },
  { "bset", STM8_BSET },
  { "btjf", STM8_BTJF },
  { "btjt", STM8_BTJT },
  { "call", STM8_CALL },
  { "callf", STM8_CALLF },
  { "callr", STM8_CALLR },
  { "ccf", STM8_CCF },
  { "clr", STM8_CLR },
  { "clrw", STM8_CLRW },
  { "cp", STM8_CP },
  { "cpw", STM8_CPW },
  { "cpl", STM8_CPL },
  { "cplw", STM8_CPLW },
  { "dec", STM8_DEC },
  { "decw", STM8_DECW },
  { "div", STM8_DIV },
  { "divw", STM8_DIVW },
  { "exg", STM8_EXG },
  { "exgw", STM8_EXGW },
  { "halt", STM8_HALT },
  { "inc", STM8_INC },
  { "incw", STM8_INCW },
  { "int", STM8_INT },
  { "iret", STM8_IRET },
  { "jp", STM8_JP },
  { "jpf", STM8_JPF },
  { "jra", STM8_JRA },
  { "jrc", STM8_JRC },
  { "jreq", STM8_JREQ },
  { "jrf", STM8_JRF },
  { "jrh", STM8_JRH },
  { "jrih", STM8_JRIH },
  { "jril", STM8_JRIL },
  { "jrm", STM8_JRM },
  { "jrmi", STM8_JRMI },
  { "jrnc", STM8_JRNC },
  { "jrne", STM8_JRNE },
  { "jrnh", STM8_JRNH },
  { "jrnm", STM8_JRNM },
  { "jrnv", STM8_JRNV },
  { "jrpl", STM8_JRPL },
  { "jrsge", STM8_JRSGE },
  { "jrsgt", STM8_JRSGT },
  { "jrsle", STM8_JRSLE },
  { "jrslt", STM8_JRSLT },
  { "jrt", STM8_JRT },
  { "jruge", STM8_JRUGE },
  { "jrugt", STM8_JRUGT },
  { "jrule", STM8_JRULE },
  { "jrult", STM8_JRULT },
  { "jrv", STM8_JRV },
  { "ld", STM8_LD },
  { "ldf", STM8_LDF },
  { "ldw", STM8_LDW },
  { "mov", STM8_MOV },
  { "mul", STM8_MUL },
  { "neg", STM8_NEG },
  { "negw", STM8_NEGW },
  { "nop", STM8_NOP },
  { "or", STM8_OR },
  { "pop", STM8_POP },
  { "popw", STM8_POPW },
  { "push", STM8_PUSH },
  { "pushw", STM8_PUSHW },
  { "rcf", STM8_RCF },
  { "ret", STM8_RET },
  { "retf", STM8_RETF },
  { "rim", STM8_RIM },
  { "rlc", STM8_RLC },
  { "rlcw", STM8_RLCW },
  { "rlwa", STM8_RLWA },
  { "rrc", STM8_RRC },
  { "rrcw", STM8_RRCW },
  { "rrwa", STM8_RRWA },
  { "rvf", STM8_RVF },
  { "sbc", STM8_SBC },
  { "scf", STM8_SCF },
  { "sim", STM8_SIM },
  { "sll", STM8_SLL },
  { "sla", STM8_SLA },
  { "sllw", STM8_SLLW },
  { "slaw", STM8_SLAW },
  { "sra", STM8_SRA },
  { "sraw", STM8_SRAW },
  { "srl", STM8_SRL },
  { "srlw", STM8_SRLW },
  { "sub", STM8_SUB },
  { "subw", STM8_SUBW },
  { "swap", STM8_SWAP },
  { "swapw", STM8_SWAPW },
  { "tnz", STM8_TNZ },
  { "tnzw", STM8_TNZW },
  { "trap", STM8_TRAP },
  { "wfe", STM8_WFE },
  { "wfi", STM8_WFI },
  { "xor", STM8_XOR },
  { NULL, 0 }
};

const struct _table_stm8_regs table_stm8_regs[] = {
  { "A", OP_REG_A },
  { "X", OP_REG_X },
  { "Y", OP_REG_Y },
  { "XL", OP_REG_XL },
  { "YL", OP_REG_YL },
  { "XH", OP_REG_XH },
  { "YH", OP_REG_YH },
  { "CC", OP_REG_CC },
  { "SP", OP_SP },
  { "?", OP_NONE },
  { NULL, 0 }
};

// October 21, 2014
// teqo: please call the table bigHonkinTable
// For instruction details see: PM0044
const struct _table_stm8_opcodes table_stm8_opcodes[] = {
  // instr_enum, type, prefix, opcode, dest, src, cycles_min, cycles_max, is_stm7

  // ADC (Addition with Carry)
  { STM8_ADC, OP_NUMBER8, 0, 0xa9, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_ADDRESS8, 0, 0xb9, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_ADDRESS16, 0, 0xc9, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_INDEX_X, 0, 0xf9, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_OFFSET8_INDEX_X, 0, 0xe9, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_OFFSET16_INDEX_X, 0, 0xd9, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_INDEX_Y, 0x90, 0xf9, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_OFFSET8_INDEX_Y, 0x90, 0xe9, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_OFFSET16_INDEX_Y, 0x90, 0xd9, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_OFFSET8_INDEX_SP, 0, 0x19, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_INDIRECT8, 0x92, 0xc9, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_INDIRECT16, 0x72, 0xc9, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_INDIRECT8_X, 0x92, 0xd9, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_INDIRECT16_X, 0x72, 0xd9, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADC, OP_INDIRECT8_Y, 0x91, 0xd9, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ADD },

  // ADD (Addition)
  { STM8_ADD, OP_NUMBER8, 0, 0xab, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_ADDRESS8, 0, 0xbb, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_ADDRESS16, 0, 0xcb, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_INDEX_X, 0, 0xfb, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_OFFSET8_INDEX_X, 0, 0xeb, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_OFFSET16_INDEX_X, 0, 0xdb, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_INDEX_Y, 0x90, 0xfb, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_OFFSET8_INDEX_Y, 0x90, 0xeb, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_OFFSET16_INDEX_Y, 0x90, 0xdb, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_OFFSET8_INDEX_SP, 0, 0x1b, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_INDIRECT8, 0x92, 0xcb, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_INDIRECT16, 0x72, 0xcb, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_INDIRECT8_X, 0x92, 0xdb, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_INDIRECT16_X, 0x72, 0xdb, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADD, OP_INDIRECT8_Y, 0x91, 0xdb, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ADD },

  // ADDW (Word Addition with index registers)
  { STM8_ADDW, OP_NUMBER16, 0, 0x1c, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADDW, OP_ADDRESS16, 0x72, 0xbb, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADDW, OP_OFFSET8_INDEX_SP, 0x72, 0xfb, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADDW, OP_NUMBER16, 0x72, 0xa9, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADDW, OP_ADDRESS16, 0x72, 0xb9, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADDW, OP_OFFSET8_INDEX_SP, 0x72, 0xf9, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_ADDW, OP_NUMBER8, 0, 0x5b, OP_SP, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_ADD },

  // AND (Logical AND)
  { STM8_AND, OP_NUMBER8, 0, 0xa4, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_ADDRESS8, 0, 0xb4, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_ADDRESS16, 0, 0xc4, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_INDEX_X, 0, 0xf4, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_OFFSET8_INDEX_X, 0, 0xe4, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_OFFSET16_INDEX_X, 0, 0xd4, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_INDEX_Y, 0x90, 0xf4, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_OFFSET8_INDEX_Y, 0x90, 0xe4, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_OFFSET16_INDEX_Y, 0x90, 0xd4, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_OFFSET8_INDEX_SP, 0, 0x14, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_INDIRECT8, 0x92, 0xc4, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_INDIRECT16, 0x72, 0xc4, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_INDIRECT8_X, 0x92, 0xd4, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_INDIRECT16_X, 0x72, 0xd4, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_AND },
  { STM8_AND, OP_INDIRECT8_Y, 0x91, 0xd4, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_AND },

