ultramango/radare2-extras/stm8/stm8_optable.c
  // BCCM (Copy Carry Bit to Memory)
  { STM8_BCCM, OP_ADDRESS_BIT, 0x90, 0x11, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_STORE }, // TODO: not sure about R_ANAL_OP_TYPE_STORE

  // BCP (Logical Bit Compare)
  { STM8_BCP, OP_NUMBER8, 0, 0xa5, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_ADDRESS8, 0, 0xb5, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_ADDRESS16, 0, 0xc5, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_INDEX_X, 0, 0xf5, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_OFFSET8_INDEX_X, 0, 0xe5, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_OFFSET16_INDEX_X, 0, 0xd5, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_INDEX_Y, 0x90, 0xf5, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_OFFSET8_INDEX_Y, 0x90, 0xe5, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_OFFSET16_INDEX_Y, 0x90, 0xd5, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_OFFSET8_INDEX_SP, 0, 0x15, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_INDIRECT8, 0x92, 0xc5, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_INDIRECT16, 0x72, 0xc5, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_INDIRECT8_X, 0x92, 0xd5, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_INDIRECT16_X, 0x72, 0xd5, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_CMP },
  { STM8_BCP, OP_INDIRECT8_Y, 0x91, 0xd5, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CMP },

  // BCPL (Bit Complement)
  { STM8_BCPL, OP_ADDRESS_BIT, 0x90, 0x10, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_STORE },

  // BREAK (Software break)
  { STM8_BREAK, OP_NONE, 0, 0x8B, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_NOP },

  // BRES (Bit Reset)
  { STM8_BRES, OP_ADDRESS_BIT, 0x72, 0x11, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_STORE },

  // BSET (Bit Set)
  { STM8_BSET, OP_ADDRESS_BIT, 0x72, 0x10, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_STORE },

  // BTJF (Bit Test and Jump if False)
  { STM8_BTJF, OP_ADDRESS_BIT_LOOP, 0x72, 0x01, OP_NONE, OP_NONE, 2,3, ST7_NO, R_ANAL_OP_TYPE_CJMP }, // TODO: how to mark relative?

  // BTJT (Bit Test and Jump if True)
  { STM8_BTJT, OP_ADDRESS_BIT_LOOP, 0x72, 0x00, OP_NONE, OP_NONE, 2,3, ST7_NO, R_ANAL_OP_TYPE_CJMP }, // TODO: how to mark relative?

  // CALL (CALL Subroutine (Absolute))
  { STM8_CALL, OP_ADDRESS16, 0, 0xcd, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CALL },
  { STM8_CALL, OP_INDEX_X, 0, 0xfd, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_RCALL },
  { STM8_CALL, OP_OFFSET8_INDEX_X, 0, 0xed, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_RCALL },
  { STM8_CALL, OP_OFFSET16_INDEX_X, 0, 0xdd, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_RCALL },
  { STM8_CALL, OP_INDEX_Y, 0x90, 0xfd, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_RCALL },
  { STM8_CALL, OP_OFFSET8_INDEX_Y, 0x90, 0xed, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_RCALL },
  { STM8_CALL, OP_OFFSET16_INDEX_Y, 0x90, 0xdd, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_RCALL },
  { STM8_CALL, OP_INDIRECT8, 0x92, 0xcd, OP_NONE, OP_NONE, 6,6, ST7_YES, R_ANAL_OP_TYPE_ICALL },
  { STM8_CALL, OP_INDIRECT16, 0x72, 0xcd, OP_NONE, OP_NONE, 6,6, ST7_NO, R_ANAL_OP_TYPE_ICALL },
  { STM8_CALL, OP_INDIRECT8_X, 0x92, 0xdd, OP_NONE, OP_NONE, 6,6, ST7_YES, R_ANAL_OP_TYPE_ICALL },
  { STM8_CALL, OP_INDIRECT16_X, 0x72, 0xdd, OP_NONE, OP_NONE, 6,6, ST7_NO, R_ANAL_OP_TYPE_ICALL },
  { STM8_CALL, OP_INDIRECT8_Y, 0x91, 0xdd, OP_NONE, OP_NONE, 6,6, ST7_YES, R_ANAL_OP_TYPE_ICALL },

  // CALLF (CALL Far Subrouting)
  { STM8_CALLF, OP_ADDRESS24, 0, 0x8d, OP_NONE, OP_NONE, 5,5, ST7_NO, R_ANAL_OP_TYPE_CALL },
  { STM8_CALLF, OP_INDIRECT16_E, 0x92, 0x8d, OP_NONE, OP_NONE, 8,8, ST7_NO, R_ANAL_OP_TYPE_ICALL },

  // CALLR (CALL Subroutine Relative)
  { STM8_CALLR, OP_RELATIVE, 0, 0xad, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_RCALL },

  // CCF (Complementary Carry Flag)
  { STM8_CCF, OP_NONE, 0, 0x8C, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_CPL },

  // CLR (Clear)
  { STM8_CLR, OP_SINGLE_REGISTER, 0, 0x4f, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_ADDRESS8, 0, 0x3f, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_ADDRESS16, 0x72, 0x5f, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_INDEX_X, 0, 0x7f, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_OFFSET8_INDEX_X, 0, 0x6f, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_OFFSET16_INDEX_X, 0x72, 0x4f, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_INDEX_Y, 0x90, 0x7f, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_OFFSET8_INDEX_Y, 0x90, 0x6f, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_OFFSET16_INDEX_Y, 0x90, 0x4f, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_OFFSET8_INDEX_SP, 0, 0x0f, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_INDIRECT8, 0x92, 0x3f, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_INDIRECT16, 0x72, 0x3f, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_INDIRECT8_X, 0x92, 0x6f, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_INDIRECT16_X, 0x72, 0x6f, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_MOV },
  { STM8_CLR, OP_INDIRECT8_Y, 0x91, 0x6f, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_MOV },

  // CLRW (Clear word)
  { STM8_CLRW, OP_SINGLE_REGISTER, 0, 0x5f, OP_REG_X, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_MOV },
  { STM8_CLRW, OP_SINGLE_REGISTER, 0x90, 0x5f, OP_REG_Y, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_MOV },

  // CP (Compare)
  { STM8_CP, OP_NUMBER8, 0, 0xa1, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_ADDRESS8, 0, 0xb1, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_ADDRESS16, 0, 0xc1, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_INDEX_X, 0, 0xf1, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_OFFSET8_INDEX_X, 0, 0xe1, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_OFFSET16_INDEX_X, 0, 0xd1, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_INDEX_Y, 0x90, 0xf1, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_OFFSET8_INDEX_Y, 0x90, 0xe1, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_OFFSET16_INDEX_Y, 0x90, 0xd1, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_OFFSET8_INDEX_SP, 0, 0x11, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_INDIRECT8, 0x92, 0xc1, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_INDIRECT16, 0x72, 0xc1, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_INDIRECT8_X, 0x92, 0xd1, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_INDIRECT16_X, 0x72, 0xd1, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_CMP },
  { STM8_CP, OP_INDIRECT8_Y, 0x91, 0xd1, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CMP },

  // CPW (Compare word)
  { STM8_CPW, OP_NUMBER16, 0, 0xa3, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_ADDRESS8, 0, 0xb3, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_ADDRESS16, 0, 0xc3, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_INDEX_Y, 0x90, 0xf3, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_OFFSET8_INDEX_Y, 0x90, 0xe3, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_OFFSET16_INDEX_Y, 0x90, 0xd3, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_OFFSET8_INDEX_SP, 0, 0x13, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_INDIRECT8, 0x92, 0xc3, OP_REG_X, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_INDIRECT16, 0x72, 0xc3, OP_REG_X, OP_NONE, 5,5, ST7_NO, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_INDIRECT8_Y, 0x91, 0xd3, OP_REG_X, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_NUMBER16, 0x90, 0xa3, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_ADDRESS8, 0x90, 0xb3, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_ADDRESS16, 0x90, 0xc3, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_INDEX_X, 0, 0xf3, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_OFFSET8_INDEX_X, 0, 0xe3, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_OFFSET16_INDEX_X, 0, 0xd3, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_INDIRECT8, 0x91, 0xc3, OP_REG_Y, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_INDIRECT8_X, 0x92, 0xd3, OP_REG_Y, OP_NONE, 5,5, ST7_NO, R_ANAL_OP_TYPE_CMP },
  { STM8_CPW, OP_INDIRECT16_X, 0x72, 0xd3, OP_REG_Y, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_CMP },

  // CPL (Logical 1's Complement)
  { STM8_CPL, OP_SINGLE_REGISTER, 0, 0x43, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_ADDRESS8, 0, 0x33, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_ADDRESS16, 0x72, 0x53, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_INDEX_X, 0, 0x73, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_OFFSET8_INDEX_X, 0, 0x63, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_OFFSET16_INDEX_X, 0x72, 0x43, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_INDEX_Y, 0x90, 0x73, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_OFFSET8_INDEX_Y, 0x90, 0x63, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_OFFSET16_INDEX_Y, 0x90, 0x43, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_OFFSET8_INDEX_SP, 0, 0x03, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_INDIRECT8, 0x92, 0x33, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_INDIRECT16, 0x72, 0x33, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_INDIRECT8_X, 0x92, 0x63, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_INDIRECT16_X, 0x72, 0x63, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_CPL },
  { STM8_CPL, OP_INDIRECT8_Y, 0x91, 0x63, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_CPL },

