ultramango/radare2-extras/stm8/stm8_optable.c
  // CPLW (Logical 1's Complement Word)
  { STM8_CPLW, OP_SINGLE_REGISTER, 0, 0x53, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CPL },
  { STM8_CPLW, OP_SINGLE_REGISTER, 0x90, 0x53, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_CPL },

  // DEC (Decrement)
  // FIXME: .w is outside the [] or non-existent.  Is this a typo in the
  // datasheet?
  { STM8_DEC, OP_SINGLE_REGISTER, 0, 0x4a, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_ADDRESS8, 0, 0x3a, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_ADDRESS16, 0x72, 0x5a, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_INDEX_X, 0, 0x7a, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_OFFSET8_INDEX_X, 0, 0x6a, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_OFFSET16_INDEX_X, 0x72, 0x4a, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_INDEX_Y, 0x90, 0x7a, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_OFFSET8_INDEX_Y, 0x90, 0x6a, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_OFFSET16_INDEX_Y, 0x90, 0x4a, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_OFFSET8_INDEX_SP, 0, 0x0a, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_INDIRECT8, 0x92, 0x3a, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_INDIRECT16, 0x72, 0x3a, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_INDIRECT8_X, 0x92, 0x6a, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_INDIRECT16_X, 0x72, 0x6a, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_DEC, OP_INDIRECT8_Y, 0x91, 0x6a, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SUB },

  // DECW (Decrement word)
  { STM8_DECW, OP_SINGLE_REGISTER, 0, 0x5a, OP_REG_X, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_DECW, OP_SINGLE_REGISTER, 0x90, 0x5a, OP_REG_Y, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SUB },

  // DIV (Divide (unsigned))
  { STM8_DIV, OP_TWO_REGISTERS, 0, 0x62, OP_REG_X, OP_REG_A, 2,17, ST7_NO, R_ANAL_OP_TYPE_DIV },
  { STM8_DIV, OP_TWO_REGISTERS, 0x90, 0x62, OP_REG_Y, OP_REG_A, 2,17, ST7_NO, R_ANAL_OP_TYPE_DIV },

  // DIVW (Divide word (unsigned))
  { STM8_DIVW, OP_TWO_REGISTERS, 0, 0x65, OP_REG_X, OP_REG_Y, 2,17, ST7_NO, R_ANAL_OP_TYPE_DIV },

  // EXG (Exchange register contents)
  { STM8_EXG, OP_TWO_REGISTERS, 0, 0x41, OP_REG_A, OP_REG_XL, 1,1, ST7_NO, R_ANAL_OP_TYPE_XCHG },
  { STM8_EXG, OP_TWO_REGISTERS, 0, 0x61, OP_REG_A, OP_REG_YL, 1,1, ST7_NO, R_ANAL_OP_TYPE_XCHG },
  { STM8_EXG, OP_ADDRESS16, 0, 0x31, OP_REG_A, OP_NONE, 3,3, ST7_NO, R_ANAL_OP_TYPE_XCHG },

  // EXGW (Exchange Index register contents)
  { STM8_EXGW, OP_TWO_REGISTERS, 0, 0x51, OP_REG_X, OP_REG_Y, 1,1, ST7_NO, R_ANAL_OP_TYPE_XCHG },

  // HALT (HALT Oscillator (CPU + Peripherals))
  { STM8_HALT, OP_NONE, 0, 0x8e, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_TRAP },

  // INC (Increment)
  // FIXME: the .w is outside the braces or non-existent.  Is this a typo
  // in the documentation?
  { STM8_INC, OP_SINGLE_REGISTER, 0, 0x4c, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_ADDRESS8, 0, 0x3c, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_ADDRESS16, 0x72, 0x5c, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_INDEX_X, 0, 0x7c, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_OFFSET8_INDEX_X, 0, 0x6c, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_OFFSET16_INDEX_X, 0x72, 0x4c, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_INDEX_Y, 0x90, 0x7c, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_OFFSET8_INDEX_Y, 0x90, 0x6c, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_OFFSET16_INDEX_Y, 0x90, 0x4c, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_OFFSET8_INDEX_SP, 0, 0x0c, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_INDIRECT8, 0x92, 0x3c, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_INDIRECT16, 0x72, 0x3c, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_INDIRECT8_X, 0x92, 0x6c, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_INDIRECT16_X, 0x72, 0x6c, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_INC, OP_INDIRECT8_Y, 0x91, 0x6c, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ADD },

  // INCW (Increment word)
  { STM8_INCW, OP_SINGLE_REGISTER, 0, 0x5c, OP_REG_X, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ADD },
  { STM8_INCW, OP_SINGLE_REGISTER, 0x90, 0x5c, OP_REG_Y, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ADD },

  // INT (Interrupt)
  { STM8_INT, OP_ADDRESS24, 0, 0x82, OP_NONE, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_CALL },

  // IRET (Interrupt return)
  { STM8_IRET, OP_NONE, 0, 0x80, OP_NONE, OP_NONE, 11,11, ST7_YES, R_ANAL_OP_TYPE_RET },

  // JP (Jump (absolute))
  { STM8_JP, OP_ADDRESS16, 0, 0xcc, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_INDEX_X, 0, 0xfc, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_OFFSET8_INDEX_X, 0, 0xec, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_OFFSET16_INDEX_X, 0, 0xdc, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_INDEX_Y, 0x90, 0xfc, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_OFFSET8_INDEX_Y, 0x90, 0xec, OP_NONE, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_OFFSET16_INDEX_Y, 0x90, 0xdc, OP_NONE, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_INDIRECT8, 0x92, 0xcc, OP_NONE, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_INDIRECT16, 0x72, 0xcc, OP_NONE, OP_NONE, 5,5, ST7_NO, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_INDIRECT8_X, 0x92, 0xdc, OP_NONE, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_INDIRECT16_X, 0x72, 0xdc, OP_NONE, OP_NONE, 5,5, ST7_NO, R_ANAL_OP_TYPE_JMP },
  { STM8_JP, OP_INDIRECT8_Y, 0x91, 0xdc, OP_NONE, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_JMP },

  // JPF (Jump far)
  { STM8_JPF, OP_ADDRESS24, 0, 0xac, OP_NONE, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_JMP },
  { STM8_JPF, OP_INDIRECT16_E, 0x92, 0xac, OP_NONE, OP_NONE, 6,6, ST7_NO, R_ANAL_OP_TYPE_JMP },

  // JRA (Jump Relative Always)
  { STM8_JRA, OP_RELATIVE, 0, 0x20, OP_NONE, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_JMP },

  // JRxx (Conditional Jump Relative Instruction)
  { STM8_JRC, OP_RELATIVE, 0, 0x25, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JREQ, OP_RELATIVE, 0, 0x27, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRF, OP_RELATIVE, 0, 0x21, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRH, OP_RELATIVE, 0x90, 0x29, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRIH, OP_RELATIVE, 0x90, 0x2f, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRIL, OP_RELATIVE, 0x90, 0x2e, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRM, OP_RELATIVE, 0x90, 0x2d, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRMI, OP_RELATIVE, 0, 0x2b, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRNC, OP_RELATIVE, 0, 0x24, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRNE, OP_RELATIVE, 0, 0x26, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRNH, OP_RELATIVE, 0x90, 0x28, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRNM, OP_RELATIVE, 0x90, 0x2c, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRNV, OP_RELATIVE, 0, 0x28, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRPL, OP_RELATIVE, 0, 0x2a, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRSGE, OP_RELATIVE, 0, 0x2e, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRSGT, OP_RELATIVE, 0, 0x2c, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRSLE, OP_RELATIVE, 0, 0x2d, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRSLT, OP_RELATIVE, 0, 0x2f, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRT, OP_RELATIVE, 0, 0x20, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRUGE, OP_RELATIVE, 0, 0x24, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRUGT, OP_RELATIVE, 0, 0x22, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRULE, OP_RELATIVE, 0, 0x23, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },

  //{ STM8_JRC, OP_RELATIVE, 0, 0x25, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRULT, OP_RELATIVE, 0, 0x25, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },
  { STM8_JRV, OP_RELATIVE, 0, 0x29, OP_NONE, OP_NONE, 1,2, ST7_YES, R_ANAL_OP_TYPE_CJMP },

  // LD A, <xxx> (Load)
  { STM8_LD, OP_NUMBER8, 0, 0xa6, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_ADDRESS8, 0, 0xb6, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_ADDRESS16, 0, 0xc6, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_INDEX_X, 0, 0xf6, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_OFFSET8_INDEX_X, 0, 0xe6, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_OFFSET16_INDEX_X, 0, 0xd6, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_INDEX_Y, 0x90, 0xf6, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_OFFSET8_INDEX_Y, 0x90, 0xe6, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_OFFSET16_INDEX_Y, 0x90, 0xd6, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_OFFSET8_INDEX_SP, 0, 0x7b, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_INDIRECT8, 0x92, 0xc6, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_INDIRECT16, 0x72, 0xc6, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_INDIRECT8_X, 0x92, 0xd6, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_INDIRECT16_X, 0x72, 0xd6, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_INDIRECT8_Y, 0x91, 0xd6, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_LOAD },

