ultramango/radare2-extras/stm8/stm8_optable.c
  // LD <xxx>, A (Load)
  { STM8_LD, OP_ADDRESS8, 0, 0xb7, OP_NONE, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_ADDRESS16, 0, 0xc7, OP_NONE, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_INDEX_X, 0, 0xf7, OP_NONE, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_OFFSET8_INDEX_X, 0, 0xe7, OP_NONE, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_OFFSET16_INDEX_X, 0, 0xd7, OP_NONE, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_INDEX_Y, 0x90, 0xf7, OP_NONE, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_OFFSET8_INDEX_Y, 0x90, 0xe7, OP_NONE, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_OFFSET16_INDEX_Y, 0x90, 0xd7, OP_NONE, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_OFFSET8_INDEX_SP, 0, 0x6b, OP_NONE, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_INDIRECT8, 0x92, 0xc7, OP_NONE, OP_REG_A, 4,4, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_INDIRECT16, 0x72, 0xc7, OP_NONE, OP_REG_A, 4,4, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_INDIRECT8_X, 0x92, 0xd7, OP_NONE, OP_REG_A, 4,4, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_INDIRECT16_X, 0x72, 0xd7, OP_NONE, OP_REG_A, 4,4, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LD, OP_INDIRECT8_Y, 0x91, 0xd7, OP_NONE, OP_REG_A, 4,4, ST7_YES, R_ANAL_OP_TYPE_STORE },

  // LD REG, REG (Load)
  { STM8_LD, OP_TWO_REGISTERS, 0, 0x97, OP_REG_XL, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_TWO_REGISTERS, 0, 0x9f, OP_REG_A, OP_REG_XL, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_TWO_REGISTERS, 0x90, 0x97, OP_REG_YL, OP_REG_A, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_TWO_REGISTERS, 0x90, 0x9f, OP_REG_A, OP_REG_YL, 1,1, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_TWO_REGISTERS, 0, 0x95, OP_REG_XH, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_TWO_REGISTERS, 0, 0x9e, OP_REG_A, OP_REG_XH, 1,1, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_TWO_REGISTERS, 0x90, 0x95, OP_REG_YH, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LD, OP_TWO_REGISTERS, 0x90, 0x9e, OP_REG_A, OP_REG_YH, 1,1, ST7_NO, R_ANAL_OP_TYPE_LOAD },

  // LDF A, <xxx> (Load Far)
  { STM8_LDF, OP_ADDRESS24, 0, 0xbc, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDF, OP_OFFSET24_INDEX_X, 0, 0xaf, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDF, OP_OFFSET24_INDEX_Y, 0x90, 0xaf, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDF, OP_INDIRECT16_E_X, 0x92, 0xaf, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDF, OP_INDIRECT16_E_Y, 0x91, 0xaf, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDF, OP_INDIRECT16_E, 0x92, 0xbc, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_LOAD },

  // LDF <xxx>, A (Load Far)
  { STM8_LDF, OP_ADDRESS24, 0, 0xbd, OP_NONE, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDF, OP_OFFSET24_INDEX_X, 0, 0xa7, OP_NONE, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDF, OP_OFFSET24_INDEX_Y, 0x90, 0xa7, OP_NONE, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDF, OP_INDIRECT16_E_X, 0x92, 0xa7, OP_NONE, OP_REG_A, 4,4, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDF, OP_INDIRECT16_E_Y, 0x91, 0xa7, OP_NONE, OP_REG_A, 4,4, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDF, OP_INDIRECT16_E, 0x92, 0xbd, OP_NONE, OP_REG_A, 4,4, ST7_NO, R_ANAL_OP_TYPE_STORE },

  // LDW X, <xxx> (Load word)
  // FIXME: Check if this is really INDEX_X.  This contradicts previous
  // instructions.  Also, it has an extra instruction.
  { STM8_LDW, OP_NUMBER16, 0, 0xae, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_ADDRESS8, 0, 0xbe, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_ADDRESS16, 0, 0xce, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_INDEX_X, 0, 0xfe, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_OFFSET8_INDEX_X, 0, 0xee, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_OFFSET16_INDEX_X, 0, 0xde, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_OFFSET8_INDEX_SP, 0, 0x1e, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_INDIRECT8, 0x92, 0xce, OP_REG_X, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_INDIRECT16, 0x72, 0xce, OP_REG_X, OP_NONE, 5,5, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_INDIRECT8_X, 0x92, 0xde, OP_REG_X, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_INDIRECT16_X, 0x72, 0xde, OP_REG_X, OP_NONE, 5,5, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_ADDRESS8, 0, 0xbf, OP_NONE, OP_REG_X, 2,2, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_ADDRESS16, 0, 0xcf, OP_NONE, OP_REG_X, 2,2, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_INDEX_X, 0, 0xff, OP_NONE, OP_REG_Y, 2,2, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_OFFSET8_INDEX_X, 0, 0xef, OP_NONE, OP_REG_Y, 2,2, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_OFFSET16_INDEX_X, 0, 0xdf, OP_NONE, OP_REG_Y, 2,2, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_OFFSET8_INDEX_SP, 0, 0x1f, OP_NONE, OP_REG_X, 2,2, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_INDIRECT8, 0x92, 0xcf, OP_NONE, OP_REG_X, 5,5, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_INDIRECT16, 0x72, 0xcf, OP_NONE, OP_REG_X, 5,5, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_INDIRECT8_X, 0x92, 0xdf, OP_NONE, OP_REG_Y, 5,5, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_INDIRECT16_X, 0x72, 0xdf, OP_NONE, OP_REG_Y, 5,5, ST7_NO, R_ANAL_OP_TYPE_STORE },

  { STM8_LDW, OP_NUMBER16, 0x90, 0xae, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_ADDRESS8, 0x90, 0xbe, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_ADDRESS16, 0x90, 0xce, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_INDEX_Y, 0x90, 0xfe, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_OFFSET8_INDEX_Y, 0x90, 0xee, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_OFFSET16_INDEX_Y, 0x90, 0xde, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_OFFSET8_INDEX_SP, 0, 0x16, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_INDIRECT8, 0x91, 0xce, OP_REG_Y, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_INDIRECT8_Y, 0x91, 0xde, OP_REG_Y, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_LOAD },
  { STM8_LDW, OP_ADDRESS8, 0x90, 0xbf, OP_NONE, OP_REG_Y, 2,2, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_ADDRESS16, 0x90, 0xcf, OP_NONE, OP_REG_Y, 2,2, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_INDEX_Y, 0x90, 0xff, OP_NONE, OP_REG_X, 2,2, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_OFFSET8_INDEX_Y, 0x90, 0xef, OP_NONE, OP_REG_X, 2,2, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_OFFSET16_INDEX_Y, 0x90, 0xdf, OP_NONE, OP_REG_X, 2,2, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_OFFSET8_INDEX_SP, 0, 0x17, OP_NONE, OP_REG_Y, 2,2, ST7_NO, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_INDIRECT8, 0x91, 0xcf, OP_NONE, OP_REG_Y, 5,5, ST7_YES, R_ANAL_OP_TYPE_STORE },
  { STM8_LDW, OP_INDIRECT8_Y, 0x91, 0xdf, OP_NONE, OP_REG_X, 5,5, ST7_YES, R_ANAL_OP_TYPE_STORE },

