ultramango/radare2-extras/stm8/stm8_optable.c
  { STM8_LDW, OP_TWO_REGISTERS, 0x90, 0x93, OP_REG_Y, OP_REG_X, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_LDW, OP_TWO_REGISTERS, 0, 0x93, OP_REG_X, OP_REG_Y, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_LDW, OP_TWO_REGISTERS, 0, 0x96, OP_REG_X, OP_SP, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_LDW, OP_TWO_REGISTERS, 0, 0x94, OP_SP, OP_REG_X, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_LDW, OP_TWO_REGISTERS, 0x90, 0x96, OP_REG_Y, OP_SP, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },
  { STM8_LDW, OP_TWO_REGISTERS, 0x90, 0x94, OP_SP, OP_REG_Y, 1,1, ST7_YES, R_ANAL_OP_TYPE_MOV },

  // MOV (Move)
  { STM8_MOV, OP_ADDRESS16_NUMBER8, 0, 0x35, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_MOV },
  { STM8_MOV, OP_ADDRESS8_ADDRESS8, 0, 0x45, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_MOV },
  { STM8_MOV, OP_ADDRESS16_ADDRESS16, 0, 0x55, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_MOV },

  // MUL (Multiply (unsigned))
  { STM8_MUL, OP_TWO_REGISTERS, 0, 0x42, OP_REG_X, OP_REG_A, 4,4, ST7_NO, R_ANAL_OP_TYPE_MUL },
  { STM8_MUL, OP_TWO_REGISTERS, 0x90, 0x42, OP_REG_Y, OP_REG_A, 4,4, ST7_NO, R_ANAL_OP_TYPE_MUL },

  // NEG (Negate (Logical 2's complement))
  { STM8_NEG, OP_SINGLE_REGISTER, 0, 0x40, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_ADDRESS8, 0, 0x30, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_ADDRESS16, 0x72, 0x50, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_INDEX_X, 0, 0x70, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_OFFSET8_INDEX_X, 0, 0x60, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_OFFSET16_INDEX_X, 0x72, 0x40, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_INDEX_Y, 0x90, 0x70, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_OFFSET8_INDEX_Y, 0x90, 0x60, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_OFFSET16_INDEX_Y, 0x90, 0x40, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_OFFSET8_INDEX_SP, 0, 0x00, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_INDIRECT8, 0x92, 0x30, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_INDIRECT16, 0x72, 0x30, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_INDIRECT8_X, 0x92, 0x60, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_INDIRECT16_X, 0x72, 0x60, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_NOT },
  { STM8_NEG, OP_INDIRECT8_Y, 0x91, 0x60, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_NOT },

  // NEGW (Negate word (Logical 2's Complement))
  { STM8_NEGW, OP_SINGLE_REGISTER, 0, 0x50, OP_REG_X, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_NOT },
  { STM8_NEGW, OP_SINGLE_REGISTER, 0x90, 0x50, OP_REG_Y, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_NOT },

  // NOP (No operation)
  { STM8_NOP, OP_NONE, 0, 0x9d, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_NOP },

  // OR (Logical OR)
  { STM8_OR, OP_NUMBER8, 0, 0xaa, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_ADDRESS8, 0, 0xba, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_ADDRESS16, 0, 0xca, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_INDEX_X, 0, 0xfa, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_OFFSET8_INDEX_X, 0, 0xea, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_OFFSET16_INDEX_X, 0, 0xda, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_INDEX_Y, 0x90, 0xfa, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_OFFSET8_INDEX_Y, 0x90, 0xea, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_OFFSET16_INDEX_Y, 0x90, 0xda, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_OFFSET8_INDEX_SP, 0, 0x1a, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_INDIRECT8, 0x92, 0xca, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_INDIRECT16, 0x72, 0xca, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_INDIRECT8_X, 0x92, 0xda, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_INDIRECT16_X, 0x72, 0xda, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_OR },
  { STM8_OR, OP_INDIRECT8_Y, 0x91, 0xda, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_OR },

  // POP (Pop from stack)
  { STM8_POP, OP_SINGLE_REGISTER, 0, 0x84, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_POP },
  { STM8_POP, OP_SINGLE_REGISTER, 0, 0x86, OP_REG_CC, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_POP },
  { STM8_POP, OP_ADDRESS16, 0, 0x32, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_POP },

  // POPW (Pop word from stack)
  // FIXME: WTF here?  all the W instructions don't have ST7 marked, but in
  // the stm8.pdf it is marked.  This looks like another mistake.
  { STM8_POPW, OP_SINGLE_REGISTER, 0, 0x85, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_POP },
  { STM8_POPW, OP_SINGLE_REGISTER, 0x90, 0x85, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_POP },

   // PUSH (Push into the Stack)
  { STM8_PUSH, OP_SINGLE_REGISTER, 0, 0x88, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_PUSH },
  { STM8_PUSH, OP_SINGLE_REGISTER, 0, 0x8a, OP_REG_CC, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_PUSH },
  { STM8_PUSH, OP_NUMBER8, 0, 0x4b, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_PUSH },
  { STM8_PUSH, OP_ADDRESS16, 0, 0x3b, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_PUSH },

  // PUSHW (Push word onto the Stack)
  // FIXME: Again it shows ST7.
  { STM8_PUSHW, OP_SINGLE_REGISTER, 0, 0x89, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_PUSH },
  { STM8_PUSHW, OP_SINGLE_REGISTER, 0x90, 0x89, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_PUSH },

  // RCF (Reset Carry Flag)
  { STM8_RCF, OP_NONE, 0, 0x98, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },

  // RET (Return from subroutine)
  { STM8_RET, OP_NONE, 0, 0x81, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_RET },

