ultramango/radare2-extras/stm8/stm8_optable.c
  // RETF (Far Return from subroutine)
  { STM8_RETF, OP_NONE, 0, 0x87, OP_NONE, OP_NONE, 5,5, ST7_NO, R_ANAL_OP_TYPE_RET },

  // RIM (Reset Interrupt Mask/Enable Interrupt)
  { STM8_RIM, OP_NONE, 0, 0x9a, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_UNK },

  // RLC (Rotate Left Logical through Carry)
  // FIXME: No other instruction has ($10,SP) support for ST7... why is it
  // set here?  This again looks like a documentation error.
  { STM8_RLC, OP_SINGLE_REGISTER, 0, 0x49, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_ADDRESS8, 0, 0x39, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_ADDRESS16, 0x72, 0x59, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_INDEX_X, 0, 0x79, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_OFFSET8_INDEX_X, 0, 0x69, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_OFFSET16_INDEX_X, 0x72, 0x49, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_INDEX_Y, 0x90, 0x79, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_OFFSET8_INDEX_Y, 0x90, 0x69, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_OFFSET16_INDEX_Y, 0x90, 0x49, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_OFFSET8_INDEX_SP, 0, 0x09, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_INDIRECT8, 0x92, 0x39, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_INDIRECT16, 0x72, 0x39, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_INDIRECT8_X, 0x92, 0x69, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_INDIRECT16_X, 0x72, 0x69, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ROL },
  { STM8_RLC, OP_INDIRECT8_Y, 0x91, 0x69, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ROL },

  // RLCW (Rotate Word Left Logical through Carry)
  // FIXME: Again it shows ST7.
  { STM8_RLCW, OP_SINGLE_REGISTER, 0, 0x59, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_ROL },
  { STM8_RLCW, OP_SINGLE_REGISTER, 0x90, 0x59, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_ROL },

  // RLWA (Rotate Word Left through A)
  { STM8_RLWA, OP_TWO_REGISTERS, 0, 0x02, OP_REG_X, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROL },
  { STM8_RLWA, OP_TWO_REGISTERS, 0x90, 0x02, OP_REG_Y, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROL },

  // RRC (Rotate Right Logical through Carry)
  // FIXME: No other instruction has ($10,SP) support for ST7... why is it
  // set here?  This again looks like a documentation error.
  { STM8_RRC, OP_SINGLE_REGISTER, 0, 0x46, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_ADDRESS8, 0, 0x36, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_ADDRESS16, 0x72, 0x56, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_INDEX_X, 0, 0x76, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_OFFSET8_INDEX_X, 0, 0x66, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_OFFSET16_INDEX_X, 0x72, 0x46, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_INDEX_Y, 0x90, 0x76, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_OFFSET8_INDEX_Y, 0x90, 0x66, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_OFFSET16_INDEX_Y, 0x90, 0x46, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_OFFSET8_INDEX_SP, 0, 0x06, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_INDIRECT8, 0x92, 0x36, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_INDIRECT16, 0x72, 0x36, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_INDIRECT8_X, 0x92, 0x66, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_INDIRECT16_X, 0x72, 0x66, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_ROR },
  { STM8_RRC, OP_INDIRECT8_Y, 0x91, 0x66, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_ROR },

  // RRCW (Rotate Word Right Logical through Carry)
  // FIXME: Again it shows ST7.
  { STM8_RRCW, OP_SINGLE_REGISTER, 0, 0x56, OP_REG_X, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_ROR },
  { STM8_RRCW, OP_SINGLE_REGISTER, 0x90, 0x56, OP_REG_Y, OP_NONE, 2,2, ST7_YES, R_ANAL_OP_TYPE_ROR },

  // RRWA (Rotate Right Word through A)
  { STM8_RRWA, OP_TWO_REGISTERS, 0, 0x01, OP_REG_X, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROR },
  { STM8_RRWA, OP_TWO_REGISTERS, 0x90, 0x01, OP_REG_Y, OP_REG_A, 1,1, ST7_NO, R_ANAL_OP_TYPE_ROR },

  // RVF (Reset overflow flag)
  { STM8_RVF, OP_NONE, 0, 0x9c, OP_NONE, OP_NONE, 5,5, ST7_YES, R_ANAL_OP_TYPE_UNK },

  // SBC (Subtraction with Carry/Borrow)
  { STM8_SBC, OP_NUMBER8, 0, 0xa2, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_ADDRESS8, 0, 0xb2, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_ADDRESS16, 0, 0xc2, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_INDEX_X, 0, 0xf2, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_OFFSET8_INDEX_X, 0, 0xe2, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_OFFSET16_INDEX_X, 0, 0xd2, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_INDEX_Y, 0x90, 0xf2, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_OFFSET8_INDEX_Y, 0x90, 0xe2, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_OFFSET16_INDEX_Y, 0x90, 0xd2, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_OFFSET8_INDEX_SP, 0, 0x12, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_INDIRECT8, 0x92, 0xc2, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_INDIRECT16, 0x72, 0xc2, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_INDIRECT8_X, 0x92, 0xd2, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_INDIRECT16_X, 0x72, 0xd2, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SBC, OP_INDIRECT8_Y, 0x91, 0xd2, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SUB },

  // SCF (Set Carry Flag)
  { STM8_SCF, OP_NONE, 0, 0x99, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },

