ultramango/radare2-extras/stm8/stm8_optable.c
  // SIM (Set Interrupt Mask/Disable Interrupt)
  { STM8_SIM, OP_NONE, 0, 0x9b, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },

  // SLL (Shift Left Logical)
  // FIXME: No other instruction has ($10,SP) support for ST7... why is it
  // set here?  This again looks like a documentation error.
  { STM8_SLL, OP_SINGLE_REGISTER, 0, 0x48, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_ADDRESS8, 0, 0x38, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_ADDRESS16, 0x72, 0x58, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_INDEX_X, 0, 0x78, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_OFFSET8_INDEX_X, 0, 0x68, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_OFFSET16_INDEX_X, 0x72, 0x48, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_INDEX_Y, 0x90, 0x78, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_OFFSET8_INDEX_Y, 0x90, 0x68, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_OFFSET16_INDEX_Y, 0x90, 0x48, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_OFFSET8_INDEX_SP, 0, 0x08, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_INDIRECT8, 0x92, 0x38, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_INDIRECT16, 0x72, 0x38, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_INDIRECT8_X, 0x92, 0x68, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_INDIRECT16_X, 0x72, 0x68, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SHL },
  { STM8_SLL, OP_INDIRECT8_Y, 0x91, 0x68, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SHL },

  // SLA (Shift Left Arithmetic)
  // TODO: put missing operations (same as SLL?)
  // Instead of making this table bigger, going to take care of an alias
  // in asm_stm8.c towards the top.

  // SLLW (Shift Left Logical Word)
  { STM8_SLLW, OP_SINGLE_REGISTER, 0, 0x58, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SHL },
  { STM8_SLLW, OP_SINGLE_REGISTER, 0x90, 0x58, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SHL },
  // SLAW
  // TODO: put missing operations (same as SLLW?)
  // Instead of making this table bigger, going to take care of an alias
  // in asm_stm8.c towards the top.

  // SRA (Shift Right Arithmetic)
  // FIXME: Again ($10,SP) is marked as ST7.
  { STM8_SRA, OP_SINGLE_REGISTER, 0, 0x47, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_ADDRESS8, 0, 0x37, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_ADDRESS16, 0x72, 0x57, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_INDEX_X, 0, 0x77, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_OFFSET8_INDEX_X, 0, 0x67, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_OFFSET16_INDEX_X, 0x72, 0x47, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_INDEX_Y, 0x90, 0x77, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_OFFSET8_INDEX_Y, 0x90, 0x67, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_OFFSET16_INDEX_Y, 0x90, 0x47, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_OFFSET8_INDEX_SP, 0, 0x07, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_INDIRECT8, 0x92, 0x37, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_INDIRECT16, 0x72, 0x37, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_INDIRECT8_X, 0x92, 0x67, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_INDIRECT16_X, 0x72, 0x67, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SAR },
  { STM8_SRA, OP_INDIRECT8_Y, 0x91, 0x67, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SAR },

  // SRAW (Shift Right Arithmetic Word)
  { STM8_SRAW, OP_SINGLE_REGISTER, 0, 0x57, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SAR },
  { STM8_SRAW, OP_SINGLE_REGISTER, 0x90, 0x57, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SAR },

  // SRL (Shift Right Logical)
  // FIXME: Again ($10,SP) is marked as ST7.
  { STM8_SRL, OP_SINGLE_REGISTER, 0, 0x44, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_ADDRESS8, 0, 0x34, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_ADDRESS16, 0x72, 0x54, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_INDEX_X, 0, 0x74, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_OFFSET8_INDEX_X, 0, 0x64, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_OFFSET16_INDEX_X, 0x72, 0x44, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_INDEX_Y, 0x90, 0x74, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_OFFSET8_INDEX_Y, 0x90, 0x64, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_OFFSET16_INDEX_Y, 0x90, 0x44, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_OFFSET8_INDEX_SP, 0, 0x04, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_INDIRECT8, 0x92, 0x34, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_INDIRECT16, 0x72, 0x34, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_INDIRECT8_X, 0x92, 0x64, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_INDIRECT16_X, 0x72, 0x64, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SHR },
  { STM8_SRL, OP_INDIRECT8_Y, 0x91, 0x64, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SHR },

  // SRLW (Shift Right Logical Word)
  { STM8_SRLW, OP_SINGLE_REGISTER, 0, 0x54, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SHR },
  { STM8_SRLW, OP_SINGLE_REGISTER, 0x90, 0x54, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SHR },

  // SUB
  { STM8_SUB, OP_NUMBER8, 0, 0xa0, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_ADDRESS8, 0, 0xb0, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_ADDRESS16, 0, 0xc0, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_INDEX_X, 0, 0xf0, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_OFFSET8_INDEX_X, 0, 0xe0, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_OFFSET16_INDEX_X, 0, 0xd0, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_INDEX_Y, 0x90, 0xf0, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_OFFSET8_INDEX_Y, 0x90, 0xe0, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_OFFSET16_INDEX_Y, 0x90, 0xd0, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_OFFSET8_INDEX_SP, 0, 0x10, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_INDIRECT8, 0x92, 0xc0, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_INDIRECT16, 0x72, 0xc0, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_INDIRECT8_X, 0x92, 0xd0, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_INDIRECT16_X, 0x72, 0xd0, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_INDIRECT8_Y, 0x91, 0xd0, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_SUB },
  { STM8_SUB, OP_NUMBER8, 0, 0x52, OP_SP, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_SUB },

  // SUBW (Word Subtraction)
  { STM8_SUBW, OP_NUMBER16, 0, 0x1d, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SUBW, OP_ADDRESS16, 0x72, 0xb0, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SUBW, OP_OFFSET8_INDEX_SP, 0x72, 0xf0, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SUBW, OP_NUMBER16, 0x72, 0xa2, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SUBW, OP_ADDRESS16, 0x72, 0xb2, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SUBW, OP_OFFSET8_INDEX_SP, 0x72, 0xf2, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SUB },
  { STM8_SUBW, OP_NUMBER8, 0, 0x52, OP_SP, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_SUB },

  // SWAP (Swap nibbles)
  // FIXME: Again ($10,SP) is marked as ST7.
  { STM8_SWAP, OP_SINGLE_REGISTER, 0, 0x4e, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_ADDRESS8, 0, 0x3e, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_ADDRESS16, 0x72, 0x5e, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_INDEX_X, 0, 0x7e, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_OFFSET8_INDEX_X, 0, 0x6e, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_OFFSET16_INDEX_X, 0x72, 0x4e, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_INDEX_Y, 0x90, 0x7e, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_OFFSET8_INDEX_Y, 0x90, 0x6e, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_OFFSET16_INDEX_Y, 0x90, 0x4e, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_OFFSET8_INDEX_SP, 0, 0x0e, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_INDIRECT8, 0x92, 0x3e, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_INDIRECT16, 0x72, 0x3e, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_INDIRECT8_X, 0x92, 0x6e, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_INDIRECT16_X, 0x72, 0x6e, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAP, OP_INDIRECT8_Y, 0x91, 0x6e, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_UNK },

  // SWAPW (Swap bytes)
  { STM8_SWAPW, OP_SINGLE_REGISTER, 0, 0x5e, OP_REG_X, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_SWAPW, OP_SINGLE_REGISTER, 0x90, 0x5e, OP_REG_Y, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },

  // TNZ (Test for Negative or Zero)
  // FIXME: Again ($10,SP) is marked as ST7.
  { STM8_TNZ, OP_SINGLE_REGISTER, 0, 0x4d, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_ADDRESS8, 0, 0x3d, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_ADDRESS16, 0x72, 0x5d, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_INDEX_X, 0, 0x7d, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_OFFSET8_INDEX_X, 0, 0x6d, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_OFFSET16_INDEX_X, 0x72, 0x4d, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_INDEX_Y, 0x90, 0x7d, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_OFFSET8_INDEX_Y, 0x90, 0x6d, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_OFFSET16_INDEX_Y, 0x90, 0x4d, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_OFFSET8_INDEX_SP, 0, 0x0d, OP_NONE, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_INDIRECT8, 0x92, 0x3d, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_INDIRECT16, 0x72, 0x3d, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_INDIRECT8_X, 0x92, 0x6d, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_INDIRECT16_X, 0x72, 0x6d, OP_NONE, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZ, OP_INDIRECT8_Y, 0x91, 0x6d, OP_NONE, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_UNK },

  // TNZW (Word Test for Negative or Zero)
  { STM8_TNZW, OP_SINGLE_REGISTER, 0, 0x5d, OP_REG_X, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_UNK },
  { STM8_TNZW, OP_SINGLE_REGISTER, 0x90, 0x5d, OP_REG_Y, OP_NONE, 2,2, ST7_NO, R_ANAL_OP_TYPE_UNK },

  // TRAP (Software interrupt)
  { STM8_TRAP, OP_NONE, 0, 0x83, OP_NONE, OP_NONE, 9,9, ST7_YES, R_ANAL_OP_TYPE_TRAP },

  // WFE (Wait for Event (CPU stopped, low power mode))
  { STM8_WFE, OP_NONE, 0x72, 0x8f, OP_NONE, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_UNK },

  // WFI (Wait for Interrupt (CPU stopped, low power mode))
  { STM8_WFI, OP_NONE, 0, 0x8f, OP_NONE, OP_NONE, 10,10, ST7_YES, R_ANAL_OP_TYPE_UNK },

  // XOR (Logical Exclusive OR)
  { STM8_XOR, OP_NUMBER8, 0, 0xa8, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_ADDRESS8, 0, 0xb8, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_ADDRESS16, 0, 0xc8, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_INDEX_X, 0, 0xf8, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_OFFSET8_INDEX_X, 0, 0xe8, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_OFFSET16_INDEX_X, 0, 0xd8, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_INDEX_Y, 0x90, 0xf8, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_OFFSET8_INDEX_Y, 0x90, 0xe8, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_OFFSET16_INDEX_Y, 0x90, 0xd8, OP_REG_A, OP_NONE, 1,1, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_OFFSET8_INDEX_SP, 0, 0x18, OP_REG_A, OP_NONE, 1,1, ST7_NO, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_INDIRECT8, 0x92, 0xc8, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_INDIRECT16, 0x72, 0xc8, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_INDIRECT8_X, 0x92, 0xd8, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_INDIRECT16_X, 0x72, 0xd8, OP_REG_A, OP_NONE, 4,4, ST7_NO, R_ANAL_OP_TYPE_XOR },
  { STM8_XOR, OP_INDIRECT8_Y, 0x91, 0xd8, OP_REG_A, OP_NONE, 4,4, ST7_YES, R_ANAL_OP_TYPE_XOR },

  { STM8_NONE, 0, 0, 0, 0, 0, 0, 0 },
};
